app/Controllers/AdminController.php

    public function adminManageOrders()
    {
        $orderModel = new Order();
        $keyword = $this->request->getVar('keyword');

        if ($keyword) {
            $data['orders'] = $orderModel->like('orderNumber', $keyword)
                ->orLike('orderDate', $keyword)
                ->orLike('status', $keyword)
                ->paginate(10);
            session()->setFlashdata('success', 'Search results for: ' . $keyword);
        } else {
            $data['orders'] = $orderModel->paginate(10); // Fetch 10 orders per page
---
SELECT *
FROM `orders`
 LIMIT 310, 10
SELECT COUNT(*) AS `numrows`
FROM `orders`