app/Controllers/AuthController.php

SELECT *
FROM `customer`
WHERE `remember_token` = '9e829a79fc5cc40061ce666aead7e751'
 LIMIT 1
---
    public function checkRememberMe()
    {
        if (isset($_COOKIE['remember_me'])) {
            $token = $_COOKIE['remember_me'];
            $model = new Customer();
            $customer = $model->where('remember_token', $token)->first();