app/Controllers/CartController.php

    public function addToCart($prodCode)
    {
        $session = session();
        $cart = $session->get('cart') ?? [];

        if (isset($cart[$prodCode])) {
            $cart[$prodCode]['quantity']++;
        } else {
            $productModel = new Product();
            $product = $productModel->find($prodCode);
---
SELECT *
FROM `product`
WHERE `product`.`prodCode` = 'S10_1949'