app/Controllers/OrderController.php

SELECT *
FROM `orders`
WHERE `oCustomerNumber` = '45454566'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `oCustomerNumber` = '45454566'
---
    public function viewAllOrders()
    {
        $session = session();
        $userId = $session->get('customer_id');

        $orderModel = new Order();
        $orders = $orderModel->where('oCustomerNumber', $userId)->paginate(10); // Fetch 10 orders per page