app/Controllers/ProductController.php

SELECT *
FROM `product`
 LIMIT 24, 12
SELECT COUNT(*) AS `numrows`
FROM `product`
---
    public function index()
    {
        $productModel = new Product();
        $data['products'] = $productModel->paginate(12); // Fetch 10 products per page